# Level Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..Level Property
BeamSystem Class See Also
---
Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Level Level { get; set; }
```

Visual Basic
---
```text
Public Property Level As Level
	Get
	Set
```

Visual C++
---
```text
public:
property Level^ Level {
	Level^ get ();
	void set (Level^ value);
}
```

# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace